#ifndef _DEFINE_H_
#define _DEFINE_H_
/////////////////////////////////////////////////////////////////////////////////////////////////

/***********************************************
					当前显示状态
***********************************************/
typedef enum {
  SUB_STATE_NORMAL			= 0,
	//////////////增加USER新的状态///////
  SUB_STATE_XXX,
	
	//////////////////////////////////////
} SUB_STATE_TypeDef;
/***********************************************
					系统切换状态
***********************************************/
typedef enum {
  STATE_NORMAL										= 0,
  STATE_FUNC_SWITCH  							= 1,
	//////////////增加USER新的状态///////
	
	//////////////////////////////////////
} SYS_SWITCH_STATE_TypeDef;

/***********************************************
					模式状态
***********************************************/
typedef enum {
  MODE_ECO_STANDBY			= 0,//关机状态进入省电模式
  MODE_STANDBY  				= 1,//关机状态
  MODE_POWER_ON 				= 2,//开机状态
	//////////////增加USER新的模式///////
	MODE_xxxx,
	
	//////////////////////////////////////	
} FUNCE_MODE_TypeDef;
	
////////////////////////////////////////////////////////////////////////
#define UP				1
#define DOWN			0

#define DEFAULT_FUNC_MODE		       MODE_POWER_ON


///////////////////////////////////////////////////////////////////////
//MCU VDD 供电电压
#define MCU_VDD_VOLT_5p2V					0
#define MCU_VDD_VOLT_5p0V					1
#define MCU_VDD_VOLT_4p2V					2
#define MCU_VDD_VOLT_3p3V					3

////////////////////////////_DEFINE_H_//endif//////////////////////////
#endif





