#ifndef _SYSTEM_CLOCK_C_
#define _SYSTEM_CLOCK_C_
/*********************************************************************************************************************/
#include "includes\headfile.h"
#ifdef HAVE_CHANGE_SYS_CLK
/*********************************************************************************************************************/
/***********************************************************************************
函数名  ：		Sys_Clk_Set_IRCH										 	
功能描述：		设置系统时钟为IRCH
输入参数：		无
返回值  ：		无
***********************************************************************************/
 void Sys_Clk_Set_IRCH(void)
{
	CKCON |= IHCKE;//											//IRCH时钟使能
	CKCON = (CKCON&0xFE) | CKSEL_IRCH;	//系统时钟切换到IRCH
	CKDIV =0x00;
} 
/***********************************************************************************/
/***********************************************************************************
函数名  ：		Sys_Clk_Set_HALF_IRCH										 	
功能描述：		设置系统时钟为IRCH的二分频
输入参数：		无
返回值  ：		无
***********************************************************************************/
void Sys_Clk_Set_HALF_IRCH(void)
{
	CKCON |= IHCKE;
	CKCON = (CKCON&0xFE) | CKSEL_IRCH;	//系统时钟切换到IRCH的二分频
	CKDIV =0x01;
}

/***********************************************************************************
函数名  ：		Sys_Clk_Set_IRCL										 	
功能描述：		设置系统时钟为IRCL
输入参数：		无
返回值  ：		无
***********************************************************************************/
 void Sys_Clk_Set_IRCL(void)
{
	CKCON |= ILCKE;						//IRCL时钟使能
	Delay_ms(1);						//使能IRCL后延时1ms，等待IRCL稳定
	CKCON = (CKCON&0xFE) | CKSEL_IRCL;	//系统时钟切换到IRCL	
	CKDIV =0x00;
} 
/***********************************************************************************/

/***********************************************************************************/
/***********************************************************************************
函数名  ：		ReadIHCFG										 	
功能描述：		
输入参数：		无
返回值  ：		无
***********************************************************************************/
unsigned char ReadIHCFG(void)    
{
	unsigned char D1,D2;
	FSCMD = 0x80; 
	PTSH = 0x00;    
	PTSL = 0x08;           
	FSCMD = 0x81;      
	D1 = FSDAT;
	D2 = FSDAT;
	FSCMD = 0;
	if(D1 == 'H')
	{
		return D2;
	}
	return IHCFG;
}


/***********************************************************************************
函数名  ：		ReadTKCCFG										 	
功能描述：		
输入参数：		无
返回值  ：		无
***********************************************************************************/
unsigned char ReadTKCCFG(void)    
{
	unsigned char D1,D2;
	FSCMD = 0x80; 
	PTSH = 0x00;    
	PTSL = 0x06;           
	FSCMD = 0x81;      
	D1 = FSDAT;
	D2 = FSDAT;
	FSCMD = 0;
	if(D1 == 'F')
	{
		return D2;
	}
	return TKCCFG;
}

/***********************************************************************************
函数名  ：		ReadIRCL_Freq										 	
功能描述：		读取内部低速时钟频率
输入参数：		无
返回值  ：		时钟频率
***********************************************************************************/
unsigned char ReadIRCL_Freq(void)    
{
	unsigned char  D1;
	unsigned char  IRCL_freq=0;
	FSCMD = 0x80; 
	PTSH = 0x00;    
	PTSL = 0x0A;           
	FSCMD = 0x81;      
	D1 = FSDAT;
	IRCL_freq=FSDAT;
	FSCMD = 0;
	if(D1 == 'L')
	{
		return IRCL_freq;
	}
	IRCL_freq=128;
	return IRCL_freq;
}
/*********************************************************************************************************************/
#endif
#endif
